#include <iostream>
#include <ctime>

using namespace std;

/* двумерный массив */

int main()
{
	setlocale(LC_ALL, "Rus");

	const int ROW = 3; // строка
	const int COL = 4; // колонна

	int arr[ROW][COL]; // объявления в массив строк и колонны.

	//////////////////////////////////////////////////////////
	arr[1][1] = 55; // присваиваем в массиве под индексом 1 (ROW) и под индексом 1 (COL) значение 55.
	cout << arr[1][1] << endl;
	/////////////////////////////////////////////////////////

	// Инициализация массива

	int arr[ROW][COL]{}; // инициализировали массив. (массив заполнился нулями).
	/////////////////////////////////////////////////////////
	
	const int ROW = 3;
	const int COL = 4;

	int arr[ROW][COL]
	{	
		{2, 4, 66, 1},
		{4, 31, 6, 7},
		{6, 24, 7, 2}
	};

	return 0;
}