/*
Типы данных в C++

- Числовые
- Символьные
- Логические

ЧИСЛА С ПЛАВАЮЩЕЙ ТОЧКОЙ
////////////////////////////////////////////////////////////////////////////////////////
float 4 byte - описывает вещественные числа одинарной точности
double 8 byte - описывает вещественные числа двойной точности

ЦЕЛЫЕ ЧИСЛА
///////////////////////////////////////////////////////////////////////////////////////
int 4 byte -   диапазон от -2147483648 до 2147483648 (описывает целые числа)
short 2 byte - диапазон от -32768 до 32768           (описывает короткие целые числа)
long 4 byte -  диапазон от -2147483648 до 2147483648 (описывает длинные целые числа)

СИМВОЛЬНЫЙ ТИП
///////////////////////////////////////////////////////////////////////////////////////
char 1 byte - описывает символы

ЛОГИЧЕСКИЙ ТИП
///////////////////////////////////////////////////////////////////////////////////////
bool 1 byte - значения - true/false (описывает логические значения)
*/